import org.junit.jupiter.api.Test;

public class Variant5 {
    @Test
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта
         (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'IDE Themes' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Введите Dracula Theme в поле поиска и из предложенных вариантов выберите Dracula Theme IDE
         (На скрине img_2 вы найдёте под пунктами 1 и 2 нужные элементы из этого шага).
         - Проверить, 5 звёзд рейтинга видны ниже заголовка Dracula Theme
         (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    @Test
    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта
         (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Code With Me' (На скрине img_4 вы найдёте под пунктом 2 элемент из этого шага).
         - Кликните по видео ролику для его начала (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что заголовок видео 'Introducing Code With Me - Collaborative Coding' виден
         (На скрине img_6 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    @Test
    void task3() {
      /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_7 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Scala' (На скрине img_7 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, лого Scala имеет расширение .svg (На скрине img_8 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }
}
