public class Variant1 {
    void task1() {
        /*
        Вам надо разработать 3 теста, сценарий для каждого теста я вам уже придумал и запишу ниже.

        Все тесты должны быть разработаны с использованием PageObject pattern (PageFactory на ваше усмотрение)

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://electrolux-market.by/
         - В навигационном меню сайта выберите пункт "Варочные панели" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что заголовок 'Варочные панели Electrolux' виден. (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).

        Второй тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://electrolux-market.by/
         - В навигационном меню сайта выберите пункт "Духовые шкафы"
         - Проверьте, что заголовок 'Духовые шкафы Electrolux' виден.

        Третий тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://electrolux-market.by/
         - В навигационном меню сайта выберите пункт "Микроволновые печи"
         - Проверьте, что заголовок 'Микроволновые печи Electrolux' виден.


         Подумайте, как записать эти 3 теста в одном тестовом методе с использованием датапровайдера.
         Эти тесты должны запускаться параллельно.
         Если вы сделаете 3 разных тестовых метода для каждого пункта меню, то такое решение не будет засчитано.
         */
    }

    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern (PageFactory на ваше усмотрение)

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://electrolux-market.by/
         - Нажать на вкладку 'Акции' в навигационном меню сайта (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что каждая картинка в карточке с акцией имеет расширение jpg (На скрине img_2 вы найдёте под пунктом 2, нужный элемент).
         */
    }

    void task3() {
      /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и PageFactor.
        Вам необходимо создать кастомный WebElement для поля поиска. На занятии мы разбирали как это делать, смотрите запись занятия, пробуйте.

          Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://electrolux-market.by/
         - В поле поиска введите 'Блендеры' и нажмите на кнопку поиска (На скрине img_3 вы найдёте под пунктами 1 и 2 элементы из этого шага).
         - Проверить, что первая карточка продукта имеет 5 звёзд рейтинга (На скрине img_3 вы найдёте под пунктом 3, нужный элемент).
         */
    }
}
