public class Variant5 {
    void task4() {
        /*
        Создайте тест с использованием Junit.
        К этому тесту у вас должен быть датапровайдер с двумя наборами данных.
        Первый набор будет иметь строки 'testing' и 'tested'.
        Второй набор будет иметь строки 'testeddddd' и 'testing'.
        Датапровайдер должен быть ввиде метода и взаимодействовать с тестом через MethodSource аннотацию.
        Напишите, единственный шаг к этому сценарию, в котором будет проверка, длинна первого значение набора,
        больше длины значения второй строки этого же набора
        В результате у вас будет сценарий выполняться 2 раза.
        Первый раз сценарий будет проверять, что длина testing больше длины tested.
        Второй раз, что длинна testeddddd больше длины testing.
         */
    }
}
