public class Variant1 {
  /*  Task 1
   ("Приведите пример, когда какая-либо коллекция выбрасывает UnsupportedOperationException.")
        Пример запишите ниже
        UnsupportedOperationException выбрасывается тогда, когда метод
        не поддерживается или не может быть выполнен в данном контексте. Пример:
        List<String> list = Arrays.asList("one", "two");
        list.add("three"); -  выбросит UnsupportedOperationException

        Task 2
        Создать динамический массив, содержащий объекты класса HeavyBox.
        Переопределить метод toString у HeavyBox
        Распечатать его содержимое используя for each и метод toString.
        Изменить вес первого ящика на 10.
        Установить вес второго ящика такой же как у первого.
        Удалить предпоследний ящик.
        Получить массив содержащий ящики из коллекции двумя способами и вывести на консоль.
        Использовать java stream api запрещено
        Удалить все ящики с разным весом.

        Task 3
        Создать класс Student, содержащий следующие характеристики – имя, группа, курс, оценки по предметам.
         Оценки должны быть в виде списка чисел.
        Создать коллекцию, содержащую объекты класса Student.
        Написать метод, который удаляет студентов со средним баллом <3.
        Если средний балл>=3, студент переводится на следующий курс.
        Напишите метод printStudents(List<Student> students, int course), который получает список студентов и номер курса.
        А также печатает на консоль имена тех студентов из списка, которые обучаются на данном курсе.
         */


}
