public class Variant5 {

    void task1() {
    /*
         Определим реализацию метода IFunction интерфейса с использованием lambda-выражения.
         В реализации метода должно быть деление первой переменной на вторую.
         Результат вывести в консоль.
         */
    }


    void task2() {
        /*
        Создать функциональный интерфейс IProduct с одним методом void iterateAndPrint(HashMap<String, Product> hashMap);
        Создайте HashMap, содержащий пары значений - имя игрушки и объект игрушки (класс Product).
        Перебрать и распечатать пары значений - entrySet().
        Перебрать и распечатать набор из имен продуктов  - keySet().
        Перебрать и распечатать значения продуктов - values().
        Для каждого перебора определить реализацию метода iterateAndPrint интерфейса IProduct с использованием lambda-выражения.
         */
    }


    void task3() {
        /*
        Создать динамический массив Product, в котором будут Product c именами, 1232345, test, Product и Testing.
        Напишите Supplier который будет возвращать тип StringBuilder.
        Внутри Supplier должна быть проверка каждого имени проекта на то, что имя не пустое.
        В результате Supplier должен вернуть все има проектов записанные через пробел. Вот пример, 1232345 test Product Testing
        Результат вывести в консоль.
         */
    }
}
