public class Variant3 {
     /* Task 1
        Создать программу для чтения данных из текстового файла variant3.txt с использованием FileInputStream.
        Файл должен находиться в том же пакете (папке) где будет запускаться ваша программа.
        При первой работе с файлом через FileInputStream, необходимо специально указать не верный путь.
        Ваша задача обработать исключение FileNotFoundException что бы в случае его возникновения создавался
        новый FileInputStream с уже верный путём к файлу.
        Содержимое файла надо вывести в консоль.
        Использовать абсолютный путь к файлам запрещено.
        Задание не будет засчитано если преподавать запустить вашу программу,
        а путь до файла будет указан как на вашем компьютере.
        Ваша программа должна работать на любом компьютере, у любого человека не зависимо от расположения файла (его пути).
        Задача рассчитана не только на работу с файлами, но и на работу с исключениями и правильную обработку их.
         */

     /* Task 2
        Создать программу для записи данных в текстовый файл c использованием BufferedOutputStream.
        Создать программно файл с названием task2.txt
        Файл должен создаваться в том же пакете (папке) где будет запускаться ваша программа.
        Записать в файл текст "Hello java, variant 3"
        Использовать абсолютный путь к файлам запрещено.
        Задание не будет засчитано если преподавать запустить вашу программу, а путь до файла будет указан как на вашем компьютере.
        Ваша программа должна работать на любом компьютере, у любого человека не зависимо от расположения файла (его пути).
         */

      /* Task 3
        Создать класс Employee с полями firstName, lastName и age. У класса должен быть конструктор принимающий все эти поля.
        Все поля должны быть приватными и иметь собственный геттер (гет метод) для публичного доступа.
        Создайте динамический массив который будет содержать несколько пользователей.
        Параметр age у класса Employee не должен сериализироваться.
        Выполнить сериализацию динамического массив в файл employee.dat
        Использовать абсолютный путь к файлам запрещено.
        Задание не будет засчитано если преподавать запустить вашу программу, а путь до файла будет указан как на вашем компьютере.
        Ваша программа должна работать на любом компьютере, у любого человека не зависимо от расположения файла (его пути).
         */
}
