import org.testng.annotations.Test;

public class Variant2 {

    @Test
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'IntelliJ IDEA' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что текст куки баннер в левом нижнем углу виден (На скрине img_1 вы найдёте под пунктом 3 элемент из этого шага).

         Все проверки в ДЗ выполнять с использованием TestNG
         */
    }

    @Test
    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'PyCharm' (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по кнопке 'Take a video tour' (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что заголовок видео 'Getting Started with PyCharm: Quick Tour' виден (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).

         Все проверки в ДЗ выполнять с использованием TestNG
         */

    }

    @Test
    void task3() {
      /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Aqua' (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что родная высота и ширина картинки 96 (На скрине img_6 вы найдёте под пунктом 1 элемент из этого шага).

        Все проверки в ДЗ выполнять с использованием TestNG
         */
    }

    void task4() {
        /*
        Вам дано 4 цифры 1,2,3,4.
        Задача написать тест с использованием датапровайдера TestNG.
        Тест должен запускаться 4 раза для каждого числа и проверять, что число для которого он запускается больше 0
         */
    }

    void task5() {
        /*
        Создайте тест с использованием TestNg.
        К этому тесту вам надо создать датапровайдер с двумя наборами данных.
        Первый набор будет иметь строки 'tested' и 'test'.
        Второй набор будет иметь строки 'testing' и 'tester'.
        Напишите проверку, что длинна первой строки из набора, больше длинны строки второй строки из этого же набора.
        В результате у вас будет тест выполняться 2 раза.
        Первый раз тест будет проверять, что длинна строки tested больше длинны строки test. Второй раз, что длинна testing больше длины tester.
         */
    }

    void task6() {
        /*
        Подключите Allure отчёт к вашим тестам или используйте отчёт из TestNG.
        Запустите ваши тесты.
        Сгенерируйте Allure или TestNG отчёт на основе результатов ваших тестов.
        Если отчёт успешно сгенерирован, то у вас будет открыт дашборд Allure или TestNG, где будут показаны ваши тесты.
        Сделайте скрин этого дашборда и добавьте его в ваш проект, по этому скрину будет понятно, что у вас всё получилось.
        Пример скрина можно найти в пакете вашего варианта под название allure.png
         */
    }
}
