public class Task2 {
         /*
        Создать перечисление (enum), содержащее жанры музыки (POP, JAZZ, METAL, ROCK, CLASSIC). Перечисление содержит
        метод getDescription, возвращающий строку "Музыка 2000". Переопределить метод getDescription - для
         константы CLASSIC метод должен возвращать строку “Музыка 1960”.  Также перечисление должно содержать
         числовое значение musicRecords(909, 1273, 1580, 998, 1540), каждое число соответствует количеству
         выпущенных музыкальных пластинок. Создать конструктор, принимающий на вход musicRecords.
        Создать интерфейсы "Музыка с клипом" с методом "запустить музыку с клипом" и "Музыка без клипа"
        с методом "запустить музыку без клипа".
        Создать абстрактный класс Музыка, содержащий переменные - жанр музыки, автор, год выпуска.
        Создать классы наследники Музыка - Apologize (реализует интерфейсы "Музыка с клипом" и "Музыка без клипа"),
         I Got You (реализует интерфейсы "Музыка с клипом" и "Музыка без клипа"), Highway To Hell
         (реализует интерфейсы "Музыка с клипом"), Anberlin (реализует интерфейсы "Музыка без клипа").
        Создать массив, содержащий все музыкальные произведения.
        Создать класс Радио, содержащий методы "запустить музыку с клипом", "запустить музыку без клипа",
        на вход которых будет поступать массив, содержащий все музыкальные произведения. Метод "запустить музыку с клипом"
        выводит на консоль всю информацию о музыкальном произведении. То же самое для метода "запустить музыку без клипа".
        */

}
