import org.junit.jupiter.api.Test;

public class Variant3 {

    @Test
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'RubyMine' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что текст 'The Most Intelligent Ruby and Rails IDE ' виден (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
        */
    }

    @Test
    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'PyCharm' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Кликнуть по кнопке 'Take a video tour'
         - Проверить, что заголовок видео 'WebStorm Overview 2021' виден (На скрине img_2 вы найдёте под пунктами 1 и 2 нужные элементы из этого шага).
         */
    }

    @Test
    void task3() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'PyCharm' (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что кнопка 'Download' не задизейблена (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }
}
