public class Variant4 {
    void task1() {
        /*
        Создать класс Product с приватными параметрами name, productId и гетеры/сеттеры для этих параметров.
        Создать динамический массив из объектов Product.
        Массив должен содержать минимум 4 продукта, название для продуктов придумайте сами.
        Изменить productId второго продукт на 0.
        Замените название последнего продукта на название первого продукта.
        С помощью Stream API выбирать из потока продукты у которых productId не ровно 0,
        если productId равен 0, то выбор продуктов надо прекратить.
        В этой же цепочке вызовов методов выполнить сортировку имени проектов по возрастанию.
        В этой же цепочке вызовов методов удалите все дубликаты и выведите каждое имя проекта в обратном порядке.
         */
    }

    void task2() {
        /*
        Создать динамический массив из объектов Product.
        Массив должен содержать минимум 8 продуктов, название для продуктов придумайте сами.
        Изменить название последних трёх продуктов на название первого продукта.
        С помощью Stream API выполнить группировку по имени проекта и посчитать сумму productId для каждой группы.
        Результат вывести в консоль
         */
    }

    void task3() {
        /*
        Создать динамический массив из объектов Product.
        Массив должен содержать минимум 8 продуктов, название для продуктов придумайте сами.
        Изменить productId последних трёх продуктов на productId первого продукта.
        С помощью Stream API выполнить группировку по productId проекта и выполнить маппинг названий продуктов для каждой группы.
        Результат вывести в консоль
         */
    }
}
