public class Variant4 {
    void task1() {
           /*
        Вам надо разработать 3 теста, сценарий для каждого теста я вам уже придумал и запишу ниже.

        Все тесты должны быть разработаны с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.relax.by/
         - В навигационном меню сайта выберите пункт "Афиша, кино" (На скрине img_1 вы найдёте под пунктом
         1 элемент из этого шага).
         - В навигационном меню сайта выберите пункт "Спектакли" (На скрине img_2 вы найдёте под пунктом
         1 элемент из этого шага).
         - Выберите тип спектакля "Мюзикл" (На скрине img_2 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверьте, что заголовок 'Мюзикл в Минске' виден. (На скрине img_2 вы найдёте под пунктом
         3 элемент из этого шага).

        Второй тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.relax.by/
         - В навигационном меню сайта выберите пункт "Афиша, кино"
         (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - В навигационном меню сайта выберите пункт "Спектакли"
         (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Выберите тип спектакля "Балет"
         - Проверьте, что заголовок 'Балет в Минске' виден.

        Третий тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.relax.by/
         - В навигационном меню сайта выберите пункт "Афиша, кино"
         (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - В навигационном меню сайта выберите пункт "Спектакли"
         (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Выберите тип спектакля "Комедия"
         - Проверьте, что заголовок 'Спектакль-комедия в Минске' виден.


         Подумайте, как записать эти 3 теста в одном тестовом методе с использованием датапровайдера.
         Эти тесты должны запускаться параллельно.
         Если вы сделаете 3 разных тестовых метода для каждого жанра, то такое решение не будет засчитано.
         */
    }

    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.relax.by/
         - В навигационном меню сайта выберите пункт "Фотоотчеты" (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что картинка фото отчета имеет расширение svg. (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    void task3() {
    /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.relax.by/
         - В навигационном меню сайта выберите пункт "Фотоотчеты" (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что кнопка "Все Фотоотчеты" видна и имеет текст "Все фотоотчеты" (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }
}
